# დავალება 1
# -----------------------------------------------------------------------------------------------------

#
# nums = [(10, 20, 40), (40, 50, 60), (70, 80, 90)]
#
# modified_samples = [(*t[:-1], new_value) for t in nums for new_value in range(100, 161, 20)]
#
# print("ცვლილებული ნიმუშები არის: ", modified_samples)
#




# დავალება 2
# -----------------------------------------------------------------------------------------------------

# nums = {3, 8, 7, 15, 5, 9}
#
# min = next(iter(nums))
# max = 0
#
# for g in nums:
#     if g > max:
#         max = g
#     if g < min:
#         min = g
#
# print("უმცირესი მონაცემი არის: ", min)
# print("უდიდესი მონაცემი არის: ", max)
#




# დავალება 3
# -----------------------------------------------------------------------------------------------------


# input = ((10, 10, 10, 12), (30, 45, 56, 45), (81, 80, 39, 32), (1, 2, 3, 4))
#
# averages = [sum(tup) / len(tup) for tup in input]
#
# print("რიცხვების საშუალო არის: ", averages)

